app/controllers/projects_controller.rb

INSERT INTO `projects` (`name`, `created_at`, `updated_at`) VALUES('Project1', '2011-08-30 09:34:30', '2011-08-30 09:34:30')
---
  def create
    @project = Project.new(params[:project])
  if @project.save